---
kind: property
id: P:Autodesk.Revit.DB.ReferenceArray.Item(System.Int32)
source: html/23d7aa42-aa2f-e9ac-150e-a860f6e13ae3.htm
---
# Autodesk.Revit.DB.ReferenceArray.Item Property

Gets or sets a reference at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Reference this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the reference to be set or retrieved.

## Returns
Returns the reference at the specified index.